{"storyboard" : [{
"id": "1",
"title" : "Personalized Reccomendation Engine for Readers",
"background" : "",
"storyoverlay":"images/schoolastic/Image_bg.jpg",
"textcolor":"#ffffff",
"navmenucolor":"#e81111" ,
"ivm":"",
"opptsketch":"",
"pptlink":"",
"pdflink":"",
"businessvalue":"",
"impactchecklist":"",
"prototypevideo":"",
"customer": "Scholastic",
"created" : "Oct. 26 2023",
"createdby" : "Chip Baber",
"video" : "https://id9ju5cntedk.objectstorage.us-ashburn-1.oci.customer-oci.com/p/od0EFXVQto7npkej8v2n7IZIXe2ZD5tOCA3llmzojjtHThI7jFYVm2ragh8NK-x4/n/id9ju5cntedk/b/Schoolastic/o/Scholastic_v5.mp4",
"storyframes" : [
  {
    "text": "Emily, a 4th grader with a head full of dreams and a heart full of curiosity, had always found solace in the pages of books. Yet, despite her love for reading, there was a constant struggle.",
    "image": "images/schoolastic/Image_01.jpg"
  },
  {
    "text": "She often stood in front of the library shelves, overwhelmed by the sea of books with no idea where to start. Some were too easy, and others were too hard. Emily felt like she was lost in a maze of words.",
    "image": "images/schoolastic/Image_02.jpg"
  },
  {
    "text": "One day, her teacher announces an upcoming book fair \"Class, we're going to the annual book fair in the school library!\" Emily sighed, her reluctance apparent. ",
    "image": "images/schoolastic/Image_03.jpg"
  },
  {
    "text": "\"Do I have to? I never find books I like there.\" Her teacher smiles reassuringly. \"This time might be different. They have a new technology that recommends books just for you.\"",
    "image": "images/schoolastic/Image_04.jpg"
  },
  {
    "text": "Curiosity piqued, Emily followed her teacher and class to the book fair and watches with mild interest as people milled around, discussing their favorite books.",
    "image": "images/schoolastic/Image_05.jpg"
  },
  {
    "text": "The fair was buzzing with excitement. ",
    "image": "images/schoolastic/Image_06.jpg"
  },
  {
    "text": "As Emily browsed the shelves, a friendly librarian named Mr. Jenkins approached her. \"Hello, Emily! I have something special for you.\" ",
    "image": "images/schoolastic/Image_07.jpg"
  },
  {
    "text": "Emily raised an eyebrow as Mrs. Jenkins handed her a tablet with an app open on the screen. \"This app,\" Mrs. Jenkins explains ",
    "image": "images/schoolastic/Image_08.jpg"
  },
  {
    "text": "\"uses a special technology that considers your interests and reading level to recommend books tailored just for you.\" ",
    "image": "images/schoolastic/Image_11.jpg"
  },
  {
    "text": "After answering a few questions about her favorite genres, hobbies, and what kind of stories she enjoyed. ",
    "image": "images/schoolastic/Image_10.jpg"
  },
  {
    "text": "The application worked its' magic.",
    "image": "images/schoolastic/Image_09.jpg"
  },
  {
    "text": "Moments later the a list of book reccomendations appeared on the screen and guided her to there location at the book fair.",
    "image": "images/schoolastic/Image_12B.jpg"
  },
  {
    "text": "Emily's eyes widened as she saw titles and covers that genuinely interested her. There were mysteries, adventures, and even a book about a young explorer just like her.",
    "image": "images/schoolastic/Image_12.jpg"
  },
  {
    "text": "Emily left the library that day with a backpack full of books and a rekindled love for book fairs. ",
    "image": "images/schoolastic/Image_13.jpg"
  },
  {
    "text": "Thanks to the technology that provided personalized recommendations, Emily had unlocked a treasure trove of stories, and her reading journey was filled with excitement and wonder.",
    "image": "images/schoolastic/Image_14.jpg"
  }
  ],
"architecture": [
                {
                    "text" : "As Emily enters her age, interests, and reading level into a tablet the information is passed to a Cloud Native mobile application built with Graal VM, Helidon, Java, or your choice of application development technologies. The application leverages secure API’s that access the recommendation engine. OCI’s API Gateway is a fully managed regional API Gateway service that provides protected RESTful API endpoints.",
                    "image" : "images/schoolastic/Slide3.jpg"
                },
                {
                  "text" : "The recommendation engine is developed inside OCI Functions. Functions provides a serverless platform for developing the search logic using a variety of programming languages including Python, Go, Java, Node and C#.  In our story Functions evaluates Emily’s preferences and provides a means for the search and display of the books tailored to her likes in the mobile application.",
                  "image" : "images/schoolastic/Slide4.jpg"
                },
                {
                  "text" : "The data is pulled from an Autonomous Data Warehouse (ADW). ADW is fully managed database environment that scales elastically, delivers fast query performance, and requires no database administration. It works directly with the Artificial Intelligence Language service. The AI Language service will match Emily’s interest against the Book Details to find age-appropriate recommendations for her.  Book Reviews from various sources including social media will be analyzed and enhanced with AI sentiment analytics to provide the best book choices tailored specifically for her.",
                  "image" : "images/schoolastic/Slide5.jpg"
                },
                {
                  "text" : "The platform has pre-gathered data from multiple sources including Bookfairs Inventory, Book Details, and Book Reviews leveraging Oracle Integration Cloud. Oracle Integration Cloud connects any application and data source using prebuilt adapters and low-code configurations.",
                  "image" : "images/schoolastic/Slide6.jpg"
                },
                {
                  "text" : " ",
                  "image" : "images/schoolastic/Slide7.jpg"
                }
  ],
"prototype": []
}]


}
